/******************************************************************
    1. Объявите переменные, используя строковые литералы ниже:
           - john.doe@example.com
           - +1-800-123-4567
           - 1234 Maple Street, Anytown, CA 90210
           - https://www.example.com
           - Error 403: Unauthorized
           - CSV means "Comma-separated values"
           - C:\Program Files\dotnet
       Дайте переменным осмысленные имена.
******************************************************************/


/***********************************************************************
    2. Создайте строку с помощью подходящего конструктора.

       Важно! Не рассматривайте любые конструкторы, которые принимают
              в себя указатели, то есть, аргументы со звёздочкой.
***********************************************************************/

// 2.1. Вам дан символ, и вам необходимо создать строку, которая повторяет этот символ 5 раз.

char symbol = '8';

// 2.2. Вам дан массив символов, который представляет собой текст "The only limit to our realization of tomorrow is our doubts of today.".
//      Вам необходимо создать строку, которая будет содержать только часть "tomorrow is our doubts" этого массива.

char[] charArray = "The only limit to our realization of tomorrow is our doubts of today.".ToCharArray();


/***********************************************************************************************************************
    3. Используя переменные из первого задания, вам нужно собрать строку, которая будет выглядеть следующим образом:
    
       "Reach me at Email: john.doe@example.com, Phone: +1-800-123-4567. Visit my website https://www.example.com."

       3.1. Используя оператор '+'.
       3.2. Используя метод "string.Concat".
       3.3. Используя метод "string.Format".
       3.4. Используя интерполяцию строк.

       Дайте переменной осмысленное имя.
***********************************************************************************************************************/


/************************************************************************************************
    4. Вам дан массив строк. Вам неообходимо сконкатенировать все строки этого массива в одну
       без всякого разделителя. То есть, слова в массиве уже даны с разделителем.
       В итоге у вас должна получиться фраза:
    
       "Imagination is more important than knowledge."

       Как бы вы это сделали?
************************************************************************************************/

string[] phraseParts = ["Imagination ", "is ", "more ", "important ", "than ", "knowledge."];


/*************************************************************************************************************************************
    5. Вам даны дата и минимальная температура эксперимента. Вам нужно собрать строку следующего вида:

       "The experiment will take place on 2024-04-10 at 14:38:00. The temperature in Celsius should not be less than -9 degrees."

       Дата, время и значение температуры должны отображаться точно так, как указано выше.
*************************************************************************************************************************************/

DateTime experimentDate = new(2024, 4, 10, 14, 38, 0); // April 10, 2024, 14:38:00
double experimentMinTemperature = -8.6;


/*****************************************************************************************************************************************************************
    6. Пользователь попытался зайти на страницу, для которой у него не хватает прав. Вы хотите вывести ему информацию в виде,
       который представлен ниже. Используйте переменные из первого задания для подстановки. Предложите несколько вариантов.

       Error 403: Unauthorized

       Unfortunately, you don't have enough permissions to access the page "Finance". If you think this is wrong, please, contact us using the information below.

       Email: john.doe@example.com
       Phone: +1-800-123-4567
       Address: 1234 Maple Street, Anytown, CA 90210

******************************************************************************************************************************************************************/


/*****************************************************************************************
    7. Вам дана строка. Вы пытаетесь привести её к верхнему регистру, но, почему-то,
       при выводе в консоль она всё также отображается в нижнем регистре.
       В чём причина? Исправьте код.
*****************************************************************************************/

string name = "john";
name.ToUpper();
Console.WriteLine(name);


/*********************************************************************************************************
    8. Вы имеете массив строк. Вам нужно собрать строку, которая будет содержать только нечётные
       элементы данного массива, склеенные через ", ". То есть, для приведённого ниже массива
       результирующая строка должна выглядеть следующим образом:

       "one, three, five, seven"
       
       Одно из возможных решений приведено ниже. Представьте, что массив может состоять из гораздо
       большего количества элементов. Может ли данное решение принести проблемы? Как его можно улучшить?
*********************************************************************************************************/

string[] strArray = ["one", "two", "three", "four", "five", "six", "seven"];  // Представьте, что могут быть тысячи элементов

string result = "";
for (int i = 0; i < strArray.Length; i += 2)
{
    result += $"{strArray[i]}, ";
}

result = result.Remove(result.Length - 2, 2);  // Удаляем последнюю запятую и пробел
Console.WriteLine(result);


/****************************************************************************************
    9. Сколько строк в памяти было создано системой в коде ниже?
       Можем ли мы уменьшить данное количество, чтобы оптимальнее использовать память?
****************************************************************************************/

string str1 = "test";
string str2 = "test";
string str3 = "te" + "st";
string strPart1 = "tes";
string strPart2 = "t";
string str4 = strPart1 + strPart2;

Console.WriteLine(ReferenceEquals(str1, str2));  // Почему True?
Console.WriteLine(ReferenceEquals(str1, str3));  // Почему True?
Console.WriteLine(ReferenceEquals(str1, str4));  // Почему False? Можно ли добиться True?


/****************************************************************************************************************
    10. Вы пытаетесь проверить, является ли символ буквой или цифрой, но почему-то получаете ошибку компиляции.
        В чём причина? Раскомментируйте и исправьте код.
****************************************************************************************************************/

var character = "H";
//Console.WriteLine(char.IsLetterOrDigit(character));
