/*****************************************************************************
    1. Какой фактический тип имеют данные неявно типизированные переменные?
*****************************************************************************/

var tempareture = 20.5f;
var length = 758934u;
var balance = 1_425_580.54M;
var speed = 120;
var bitFlags = 0b_1010_0001;
var fileSizeInBytes = 74238075234;
var roomsCount = (short)3;
var massOfTheSun = 1.989e30;
var distance = 758934LU;
var memoryAddress = 0xF0423AC5F;
var interestRate = 0.035;
var electronCharge = -1.602e-19;


/*************************************
    2. Исправьте ошибки компиляции
*************************************/

float rate = 12.5;
decimal cash = 525.3;
byte grade = 5u;
long distanceToAlphaCentauri = 4.37e16;
int percentage = 80.0;


/*********************************************************************************************************
    3. Вы вычисляете среднюю скорость автомобиля. Вам дано расстояние в км и время в часах.
       Но почему-то ваш результат обрезается до целого числа. В чём проблема? Как это можно исправить?
*********************************************************************************************************/

int distanceToCityInKm = 230;
int timeInHours = 4;
var averageSpeed = distanceToCityInKm / timeInHours;
Console.WriteLine($"The average speed is: {averageSpeed} km/h");


/*********************************************************************************************************************************
    4. Вам дано целое число, и вам необходимо определить, кратно ли оно 3-м. Какую арифметическую операцию вы бы использовали?
*********************************************************************************************************************************/
var num = 4238445;


/*******************************************************************************************************
    5. Объявите переменную "x", равную 25. Декрементируйте её 3 раза, и инкрементируйте два раза.
       Используйте разные формы инкремента и декремента. Выведите на консоль получившийся результат.
*******************************************************************************************************/


/*********************************************************************************************************
    6. Я ожидаю на консоле 9, а почему-то получаю 8. Почему? Предложите несколько вариантов исправления.
*********************************************************************************************************/

var n = 8;
var k = n++;
Console.WriteLine(k);
