/*******************************************************************************************
    1. Данные имена выдают ошибки компиляции. Определите почему и предложите исправления.
*******************************************************************************************/

string $name = "Alice";
string 1cTitle = "1C System";
int pages-count = 598;
string namespace = "Database";


/*********************************************************************************************************************
    2. Данные имена валидны, но не соответствуют конвенции. Поправьте имена переменных в соответствии с конвенцией.
*********************************************************************************************************************/

string Description = "Social media site";
decimal total_price = 1000000;
bool isbusy = false;
char _symbol = 'A';


/**********************************************************************************************************
    3. Хорошие ли имена у объявленных ниже переменных? Если нет, то предложите более подходящие имена.
**********************************************************************************************************/

int h = 68;                 // Предназначена для хранения максимальной высоты здания.
decimal b = 523468;         // Предназначена для хранения баланса по счёту клиента.
double at = 22.5;           // Предназначена для хранения средней температуры в комнате.
bool flag = true;           // Предназначена для хранения флага, авторизован ли пользователь в системе.
byte здоровьеИгрока = 78;   // Предназначена для хранения здоровья игрока.


/************************************
    4. Исправьте ошибки типизации.
************************************/

byte amplitude = -50;
short numberOfLikes = 68423;
uint worldPopulation = 8100000000;
char userName = 'Bob';
bool isCompleted = "true";
double bankAccountBalance = 7543279;


/*****************************************
    5. Упростите объявления переменных.
*****************************************/

Int32 pageNum = 341;
String articleName = "Animals of Africa";
Boolean isAlive = new bool();
UInt16 flightAltitude = 5534;
Single distance = new Single();


/***************************************
    6. Исправьте ошибки компиляции.
***************************************/

var emailAddress;
emailAddress = "test@mail.ru";

int minutesCount;
Console.WriteLine(minutesCount);
minutesCount = 10;

byte plainSpeed = 180;
plainSpeed = 720;

char digit = '9';
digit = '10';

const int viewsCount = 2342;
viewsCount = 4289;

const int character = Console.Read();


/***********************************************************************
    7. Какой фактический тип имеют неявно типизированные переменные?
***********************************************************************/

var isHealthy = true;
var message = "Hello!";
var ruble = '₽';
var weight = 50.6;
var distanceToAndromeda = 24600000000000000;
var key = Console.ReadKey();


/***********************************************************************************************************************
    8. Вам нужно хранить температуру по Цельсию в пределах от абсолютного нуля до примерно 8000 градусов.
       При этом вам нужно хранить только целочисленные значения температуры.
         8.1. Какой тип данных вы могли бы выбрать для данной задачи? Предложите несколько вариантов.
         8.2. Если бы вам нужно было хранить температуру от 0 до 200 градусов, расширился ли бы список подходящих типов?
              А если бы вы были ограничены только CLS-совместимыми типами?
***********************************************************************************************************************/
