/******************************************************************
    1. Некоторые строки не компилируются. Почему? Исправьте код.
******************************************************************/

int i = 53;

long l = i;
float f = i;
byte b = i;
i = b;
double d = f;
b = f;
ushort us = b;
f = d;
decimal c = d;
c = i;
i = l;
i = us;
f = l;


/****************************************************************************
    2. Cтроки не компилируются. Почему? Исправьте код.
       Для некоторых строк предложите больше одного варианта исправления.
****************************************************************************/

short height = 342;
short width = height - 100;
height = height / 2;

var f1 = 1.5f;
var f2 = 2.5;
float product = f1 * f2;

int x = 1000;
long y = 2000;
int sum = x + y;

decimal cash = 5000m;
decimal total = cash + 50.7;

int num1 = 80342;
double num2 = 6543;
int diff = num1 - num2;



//byte num = 128 * 2;
